{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "242cae4f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "52"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Задача 1. Создайте список из всех натуральных чисел от 1 до 50 включительно, используя функцию range. \n",
    "# Превратите этот список в множество. Добавьте числа 21, 24, 29, 53, 104. Чему равна len этого множества?\n",
    "x = []\n",
    "for i in range(1,51,1):\n",
    "    x.append(i)\n",
    "setx = set(x)\n",
    "setx.update([21,24,29,53,104])\n",
    "len(setx)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "199697db",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "45150"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Задача 2. Создайте список из всех натуральных чисел от 1 до 300 включительно. \n",
    "# Затем создайте список из целых четных чисел от 115 до 229. Для удобства используйте функцию range.\n",
    "# Превратите эти списки в множества. \n",
    "# Создайте третье множество, которое будет объединением первых двух. \n",
    "# Полученное множество переведите в список и посчитайте сумму. \n",
    "# Подсказка: Чтобы объединить множества, используйте метод union.\n",
    "x = set(range(1,301))\n",
    "y = set(range(115,230))\n",
    "z = x.union(y)\n",
    "z = list(z)\n",
    "sum(z)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "dc6b6910",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{26, 101, 89, 90, 25}\n"
     ]
    }
   ],
   "source": [
    "# Задача 3. Дано два множества:\n",
    "# x={25,33,67,89}\n",
    "# y={26,33,67,90,101}\n",
    "# Какой метод нужно применить, чтобы получить следующее множество?\n",
    "# y={26, 101, 89, 90, 25}\n",
    "# В ответе запишите название без точек и скобок\n",
    "x={25, 33, 67, 89}\n",
    "y={26, 33, 67, 90, 101}\n",
    "print(x.symmetric_difference(y))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "1fe25ad2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "6"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Задача 4. Создайте список из чисел от 100 до 300 включительно, которые делятся на 17.\n",
    "# Для удобства используйте функцию range и условие. Превратите список в множество set_1.\n",
    "# Создайте второе множество set_2 из всех целых чисел от 200 до 400 включительно.\n",
    "# Найдите множество чисел set_3, которые входят в set_1, но не входят во второе множество set_2.\n",
    "# Чему равна длина множества set_3?\n",
    "# Подсказка: Вам могут пригодиться append() и difference().\n",
    "x = []\n",
    "for i in range(100,301):\n",
    "    if i % 17 == 0:\n",
    "        x.append(i)\n",
    "set_1 = set(x)\n",
    "set_2 = set(range(200,401))\n",
    "set_3 = set_1.difference(set_2)\n",
    "len(set_3)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "900013a1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "909"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Задача 5. Дано два сета.\n",
    "# set_1 = {97, 65, 100, 6, 39, 43, 46, 55, 57, 29}\n",
    "# set_2 = {33, 98, 97, 4, 37, 36, 6, 34, 59, 75, 77, 47, 83, 84, 51, 91, 92, 30}\n",
    "# Оставьте первый сет set_1 без изменения, а во втором сете set_2 оставьте только те значения, которые делятся на 2.\n",
    "# После сделайте новый сет set_3, который содержит значения, которые есть только в set_1 или set_2 , но не в двух одновременно.\n",
    "# В ответ запишите сумму всех значений нового сета.\n",
    "\n",
    "# Подсказка: Чтобы убрать из второго множества set_2 числа, которые не делятся на 2, сделайте следующее:\n",
    "# Создайте новый пустой список list_2.\n",
    "# Преобразуйте множество set_2 в список.\n",
    "# Пройдитесь по всем элементам списка set_2, добавляя в новый список list_2 только те элементы, которые делятся на 2.\n",
    "# Преобразуйте list_2 в множество.\n",
    "\n",
    "set_1 = {97, 65, 100, 6, 39, 43, 46, 55, 57, 29}\n",
    "set_2 = {33, 98, 97, 4, 37, 36, 6, 34, 59, 75, 77, 47, 83, 84, 51, 91, 92, 30}\n",
    "x = []\n",
    "for i in set_2:\n",
    "    if i % 2 == 0:\n",
    "        x.append(i)\n",
    "set_2 = set(x)\n",
    "set_3 = set_1.symmetric_difference(set_2)\n",
    "sum(set_3)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
